In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser = Series(np.random.randn(6), index = [[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [3]:
ser

1  a   -0.410533
   b    0.788589
   c   -1.035884
2  a   -1.722831
   b    0.568493
   c   -0.814340
dtype: float64

In [4]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [5]:
ser[1]

a   -0.410533
b    0.788589
c   -1.035884
dtype: float64

In [9]:
ser

1  a   -0.410533
   b    0.788589
   c   -1.035884
2  a   -1.722831
   b    0.568493
   c   -0.814340
dtype: float64

In [7]:
ser[:,'a']

1   -0.410533
2   -1.722831
dtype: float64

In [11]:
dframe = ser.unstack()

In [12]:
dframe

          a         b         c
1 -0.410533  0.788589 -1.035884
2 -1.722831  0.568493 -0.814340

In [13]:
dframe.unstack()

a  1   -0.410533
   2   -1.722831
b  1    0.788589
   2    0.568493
c  1   -1.035884
   2   -0.814340
dtype: float64

In [15]:
dframe.T.unstack()

1  a   -0.410533
   b    0.788589
   c   -1.035884
2  a   -1.722831
   b    0.568493
   c   -0.814340
dtype: float64

In [17]:
dframe2 = DataFrame(np.arange(16).reshape((4,4)),
                   index = [['a','a','b','b'],[1,2,1,2]],
                   columns=[['NY','NY','LA','SF'],['cold','hot','cold','hot']])

In [18]:
dframe2

      NY       LA  SF
    cold hot cold hot
a 1    0   1    2   3
  2    4   5    6   7
b 1    8   9   10  11
  2   12  13   14  15

In [19]:
dframe2.index.names = ['INDEX_1','INDEX_2']

In [20]:
dframe2

                  NY       LA  SF
                cold hot cold hot
INDEX_1 INDEX_2
a       1          0   1    2   3
        2          4   5    6   7
b       1          8   9   10  11
        2         12  13   14  15

In [21]:
dframe2.columns.names=['Cities','Temp']

In [22]:
dframe2

Cities            NY       LA  SF
Temp            cold hot cold hot
INDEX_1 INDEX_2
a       1          0   1    2   3
        2          4   5    6   7
b       1          8   9   10  11
        2         12  13   14  15

In [23]:
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot cold hot
Cities            NY  NY   LA  SF
INDEX_1 INDEX_2
a       1          0   1    2   3
        2          4   5    6   7
b       1          8   9   10  11
        2         12  13   14  15

In [27]:
dframe2.sort_index(level=1)

Cities            NY       LA  SF
Temp            cold hot cold hot
INDEX_1 INDEX_2
a       1          0   1    2   3
b       1          8   9   10  11
a       2          4   5    6   7
b       2         12  13   14  15

In [29]:
dframe2.sum(level='Temp', axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           2    4
        2          10   12
b       1          18   20
        2          26   28